# CheckProjectPhase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckProjectPhase Method
EnergyDataSettings Class See Also
---
Checks that the input element is a project phase.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool CheckProjectPhase(
	ElementId projectPhaseId
)
```

Visual Basic
---
```text
Public Function CheckProjectPhase ( _
	projectPhaseId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CheckProjectPhase(
	ElementId^ projectPhaseId
)
```

# ### Parameters
projectPhaseId
    Type: Autodesk.Revit.DB..::..ElementId The element to be checked.
# ### Return Value
True if the input element is a project phase, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace